var RETURN =
{
    errno: "0",
    error: "",
    data: {
        "B": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "H": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "J": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "K": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "L": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "M": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "N": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "O": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "P": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "Q": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "R": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "S": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "T": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "U": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "V": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "W": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "X": [
            {
                "id": 1,
                "name": "北京市"
            },
            {
                "id": 160,
                "name": "北海市"
            }
        ],
        "Y": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ],
        "Z": [
            {
                "id": 182,
                "name": "淮北市"
            },
            {
                "id": 338,
                "name": "海北州"
            }
        ]
    }
}


module.exports = function (req, res, next) {
    setTimeout(function(){
        res.json(RETURN);
    },1000)
}